000_РОЗНИЦА_ЦЕНТР/src/Documents/ЗапросДоступностиТоваров/ЗапросДоступностиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗапросДоступностиТоваров</name>
  <registerRecords>AccumulationRegister.ТТН</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыПокупателей</registerRecords>
  <registerRecords>AccumulationRegister.БонусныеБаллыПоЗаказамПокупателей</registerRecords>
  <attributes>
    <name>ВерсияИМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияП</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснованиеТекст</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоставкаНаАдрес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МагазинОтправитель</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>МагазинПолучатель</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>ОператорДоставки</name>
    <type>
      <types>EnumRef.ОператорыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьВNavision</name>
    <type>
      <types>EnumRef.СтатусыЗапросаДоступностиВNavision</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗапроса</name>
    <type>
      <types>EnumRef.СтатусыЗапросовДоступностиТоваровШапка</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОплатыДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипДоставки</name>
    <type>
      <types>EnumRef.ТипДоставкиЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>EnumRef.ТипОплатыЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ТовароТранспортнаяНакладная</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОплаты</name>
    <type>
      <types>EnumRef.СтатусОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОкругления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоТребование</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусЗапроса</name>
      <type>
        <types>EnumRef.СтатусыЗапросовДоступностиТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВсего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаОкругления</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПродажаПодарка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДоставки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Упаковки</name>
    <attributes>
      <name>Ширина</name>
      <comment>Ширина в см.</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Высота</name>
      <comment>Высота в см.</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Глубина</name>
      <comment>Глубина в см.</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <comment>Вес, кг</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Оплата</name>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПричинаИзменений</name>
    <attributes>
      <name>ДатаИзменения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Причина</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/Штрихкоды/Штрихкоды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Штрихкоды</name>
  <resources>
    <name>ДатаИзменения</name>
    <comment>Внешнее управление: NAV</comment>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Блокирован</name>
    <comment>Внешнее управление: NAV</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ПредставлениеШтрихкода</name>
    <type>
      <types>Characteristic.ТипыШтрихкодов</types>
    </type>
  </attributes>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>Characteristic.ТипыШтрихкодов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Владелец</name>
    <type>
      <types>CatalogRef.ИнформационныеКарты</types>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипШтрихкода</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ТипыШтрихкодов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/КомментарийПоСтрокам/КомментарийПоСтрокам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КомментарийПоСтрокам</name>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Просмотрен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ВозвратИнтернетЗаказа</types>
      <types>DocumentRef.ЗапросДоступностиТоваров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючСвязи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Enums/СтатусыЗапросовДоступностиТоваровШапка/СтатусыЗапросовДоступностиТоваровШапка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗапросовДоступностиТоваровШапка</name>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>Удалён</name>
  </enumValues>
  <enumValues>
    <name>КОтправке</name>
  </enumValues>
  <enumValues>
    <name>Отменён</name>
  </enumValues>
  <enumValues>
    <name>Изменён</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>Сборка</name>
  </enumValues>
  <enumValues>
    <name>ПродажаНаКассе</name>
  </enumValues>
  <enumValues>
    <name>ПродажаБезнал</name>
  </enumValues>
  <enumValues>
    <name>ЧастичноСогласован</name>
  </enumValues>
  <enumValues>
    <name>Отправлен</name>
  </enumValues>
  <enumValues>
    <name>Получен</name>
  </enumValues>
  <enumValues>
    <name>ПодтвердитьОтмену</name>
  </enumValues>
  <enumValues>
    <name>Выдан</name>
  </enumValues>
  <enumValues>
    <name>ЧекВКЦ</name>
  </enumValues>
  <enumValues>
    <name>ВыданДоставке</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Enums/СтатусыПосылокСлужбыДоставки/СтатусыПосылокСлужбыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПосылокСлужбыДоставки</name>
  <enumValues>
    <name>Получена</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
  <enumValues>
    <name>Новая</name>
  </enumValues>
  <enumValues>
    <name>Доставлена</name>
  </enumValues>
  <enumValues>
    <name>ВДороге</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКонтактнойИнформации</name>
  <enumValues>
    <name>Адрес</name>
  </enumValues>
  <enumValues>
    <name>Телефон</name>
  </enumValues>
  <enumValues>
    <name>АдресЭлектроннойПочты</name>
  </enumValues>
  <enumValues>
    <name>ВебСтраница</name>
  </enumValues>
  <enumValues>
    <name>Факс</name>
  </enumValues>
  <enumValues>
    <name>Другое</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Documents/ЗапросДоступностиТоваров/Forms/РабочийСтолОбработкаИМ/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем СтрокаЗапроса;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьТЗСтатусовЗапросаДоступности();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	// ПодключаемоеОборудование
	Если МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда
		ОписаниеОшибки = "";

		ПоддерживаемыеТипыВО = Новый Массив();
		ПоддерживаемыеТипыВО.Добавить("СканерШтрихкода");

		Если Не МенеджерОборудованияКлиент.ПодключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО, ОписаниеОшибки) Тогда
			ТекстСообщения = НСтр("ru = 'При подключении оборудования произошла ошибка:
			                      |""%ОписаниеОшибки%"".'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование

	//РегистрацияАктивностиПользователя(0,,"#Начало работы");//1	
	ПодключитьОбработчикОжидания("ОбновитьДанные", 60);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// + Бакан 25.05.2023
	Если Источник = "ПодключаемоеОборудование"
	   И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" Тогда
			Если Параметр[1] = Неопределено Тогда
				ТекКод = Параметр[0];
				ДокСсылка = НайтиДокумент(ТекКод);
				Если ЗначениеЗаполнено(ДокСсылка) тогда 
					ОткрытьЗначение(ДокСсылка);
				Иначе
					Сообщить("Ошибка! Документ в базе не найден!");
				КонецЕсли;				
			Иначе
				ТекКод = Параметр[1][1];
				ДокСсылка = НайтиДокумент(ТекКод);
				Если ЗначениеЗаполнено(ДокСсылка) тогда 
					ОткрытьЗначение(ДокСсылка);
				Иначе
					Сообщить("Ошибка! Документ в базе не найден!");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
 
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НомерЗаказаПриИзменении(Элемент)

	ЗаполнитьТЗСтатусовЗапросаДоступности(); 

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСтатусыЗапросовДоступности

&НаКлиенте
Процедура СтатусыЗапросовДоступностиПриАктивизацииСтроки(Элемент)

	Если Не Элементы.СтатусыЗапросовДоступности.ТекущиеДанные = Неопределено Тогда
		СтатусЗапроса = Элементы.СтатусыЗапросовДоступности.ТекущиеДанные.СтатусЗапросаПеречисление;
	Иначе
		СтатусЗапроса = ПредопределенноеЗначение("Перечисление.СтатусыЗапросовДоступностиТоваровШапка.ПустаяСсылка");
	КонецЕсли;
	
	СтрокаЗапроса = СтатусЗапроса;
	
	ЗапросыДоступности.Параметры.УстановитьЗначениеПараметра("СтатусЗапроса", СтатусЗапроса);
	ЗапросыДоступности.Параметры.УстановитьЗначениеПараметра("НомерЗаказа", "%" + СокрЛП(НомерЗаказа) + "%");
	ЗапросыДоступности.Параметры.УстановитьЗначениеПараметра("ВсеЗаказы", ПустаяСтрока(НомерЗаказа));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗапросыДоступности

&НаКлиенте
Процедура ЗапросыДоступностиПриАктивизацииСтроки(Элемент)
	ЗаказыПокупателейКлиент.ОформитьКнопкуИзменениеСтатусаДокумента(Элементы.ЗапросыДоступности.ТекущаяСтрока, ЭтотОбъект, "ФормаСписка");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьСтатусыЗапросаДоступности(Команда) 
	ОбновитьЗапросыДоступности();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция  НайтиДокумент(ТекКод)
	ДокСсылка = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Штрихкоды.Владелец КАК Владелец
		|ИЗ
		|	РегистрСведений.Штрихкоды КАК Штрихкоды
		|ГДЕ
		|	Штрихкоды.Штрихкод = &Штрихкод";
	
	Запрос.УстановитьПараметр("Штрихкод", ТекКод);
	
	РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ДокСсылка=ВыборкаДетальныеЗаписи.Владелец;
		КонецЦикла;
Возврат ДокСсылка;	
КонецФункции

&НаКлиенте
Функция ПолучитьЗначениеСвойства(Переменная, Свойство)
	Если Переменная<>Неопределено 
		И ТипЗнч(Переменная)<>Тип("Null")
		И ТипЗнч(Переменная)<>Тип("Строка")
		И ТипЗнч(Переменная)<>Тип("Число")
		И ТипЗнч(Переменная)<>Тип("Дата")
		И ТипЗнч(Переменная)<>Тип("Булево")
		И ТипЗнч(Переменная)<>Тип("ДекорацияФормы")
		Тогда
		Стр = Новый Структура(Свойство, Неопределено);
		ЗаполнитьЗначенияСвойств(Стр, Переменная);
		Возврат Стр[Свойство];
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

&НаСервере
Процедура ЗаполнитьТЗСтатусовЗапросаДоступности()  
	
	СтатусыЗапросовДоступности.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЗапросДоступностиТоваров.Ссылка,
		|	ЗапросДоступностиТоваров.СтатусЗапроса,
		|	ЗапросДоступностиТоваров.ДокументОснование,
		|	ЗапросДоступностиТоваров.Номер
		|ПОМЕСТИТЬ ЗапросыДоступности
		|ИЗ
		|	Документ.ЗапросДоступностиТоваров КАК ЗапросДоступностиТоваров
		|ГДЕ
		|	ЗапросДоступностиТоваров.МагазинОтправитель = &Магазин
		|	И (ЗапросДоступностиТоваров.СтатусЗапроса = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросовДоступностиТоваровШапка.Новый)
		|	ИЛИ ЗапросДоступностиТоваров.СтатусЗапроса = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросовДоступностиТоваровШапка.Изменён)
		|	ИЛИ ЗапросДоступностиТоваров.СтатусЗапроса = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросовДоступностиТоваровШапка.ВРаботе)
		|	ИЛИ ЗапросДоступностиТоваров.СтатусЗапроса = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросовДоступностиТоваровШапка.Согласован)
		|	ИЛИ ЗапросДоступностиТоваров.СтатусЗапроса = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросовДоступностиТоваровШапка.Сборка)
		|	ИЛИ ЗапросДоступностиТоваров.СтатусЗапроса = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросовДоступностиТоваровШапка.КОтправке)
		|	ИЛИ ЗапросДоступностиТоваров.СтатусЗапроса = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросовДоступностиТоваровШапка.Выдан)
		|	ИЛИ ЗапросДоступностиТоваров.СтатусЗапроса = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросовДоступностиТоваровШапка.ВыданДоставке)
		|	ИЛИ ЗапросДоступностиТоваров.СтатусЗапроса = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросовДоступностиТоваровШапка.Отправлен)
		|	ИЛИ ЗапросДоступностиТоваров.СтатусЗапроса = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросовДоступностиТоваровШапка.Получен)
		|	ИЛИ
		|		ЗапросДоступностиТоваров.СтатусЗапроса = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросовДоступностиТоваровШапка.ТоварВМагазине)
		|	ИЛИ
		|		ЗапросДоступностиТоваров.СтатусЗапроса = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросовДоступностиТоваровШапка.ПодтвердитьОтмену)
		|	ИЛИ ЗапросДоступностиТоваров.СтатусЗапроса = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросовДоступностиТоваровШапка.Отменён)
		|	ИЛИ ЗапросДоступностиТоваров.СтатусЗапроса = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросовДоступностиТоваровШапка.Закрыт))
		|	ИЛИ ЗапросДоступностиТоваров.МагазинПолучатель = &Магазин
		|	И (ЗапросДоступностиТоваров.СтатусЗапроса = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросовДоступностиТоваровШапка.Отправлен)
		|	ИЛИ
		|ЗапросДоступностиТоваров.СтатусЗапроса = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросовДоступностиТоваровШапка.ВыданДоставке)
		|	ИЛИ
		|		ЗапросДоступностиТоваров.СтатусЗапроса = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросовДоступностиТоваровШапка.ТоварВМагазине)
		|	ИЛИ ЗапросДоступностиТоваров.СтатусЗапроса = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросовДоступностиТоваровШапка.Получен)
		|	ИЛИ
		|		ЗапросДоступностиТоваров.СтатусЗапроса = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросовДоступностиТоваровШапка.ПродажаБезнал)
		|	ИЛИ
		|		ЗапросДоступностиТоваров.СтатусЗапроса = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросовДоступностиТоваровШапка.ПродажаНаКассе)
		|	ИЛИ ЗапросДоступностиТоваров.СтатусЗапроса = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросовДоступностиТоваровШапка.Отменён)
		|	ИЛИ ЗапросДоступностиТоваров.СтатусЗапроса = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросовДоступностиТоваровШапка.Закрыт))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЗапросыДоступности.Ссылка КАК Ссылка,
		|	ЗапросыДоступности.СтатусЗапроса КАК СтатусЗапроса,
		|	ЗапросыДоступности.ДокументОснование КАК ДокументОснование
		|ПОМЕСТИТЬ ЗаказыСтатус
		|ИЗ
		|	ЗапросыДоступности КАК ЗапросыДоступности
		|ГДЕ
		|	(ЗапросыДоступности.Номер ПОДОБНО &НомерЗаказа
		|	ИЛИ &ВсеЗапросы)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗапросыДоступности.Ссылка,
		|	ЗапросыДоступности.СтатусЗапроса,
		|	ЗапросыДоступности.ДокументОснование
		|ИЗ
		|	ЗапросыДоступности КАК ЗапросыДоступности
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭлектроннаяНакладная КАК ЭлектроннаяНакладная
		|		ПО ЗапросыДоступности.Ссылка = ЭлектроннаяНакладная.ДокументОснование
		|		И НЕ ЭлектроннаяНакладная.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПосылокСлужбыДоставки.Отменена)
		|ГДЕ
		|	(ЭлектроннаяНакладная.Номер ПОДОБНО &НомерЗаказа
		|	ИЛИ &ВсеЗапросы)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗапросыДоступности.Ссылка,
		|	ЗапросыДоступности.СтатусЗапроса,
		|	ЗапросыДоступности.ДокументОснование
		|ИЗ
		|	ЗапросыДоступности КАК ЗапросыДоступности
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
		|			ПО (КонтрагентыКонтактнаяИнформация.Ссылка = ЗаказПокупателя.Контрагент)
		|			И (КонтрагентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
		|		ПО ЗапросыДоступности.ДокументОснование = ЗаказПокупателя.Ссылка
		|ГДЕ
		|	(КонтрагентыКонтактнаяИнформация.НомерТелефона ПОДОБНО &НомерЗаказа
		|	ИЛИ &ВсеЗапросы)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВложенныйЗапрос.СтатусЗапроса КАК СтатусЗапроса,
		|	СУММА(ВложенныйЗапрос.КоличествоСообщений) КАК КоличествоСообщений
		|ПОМЕСТИТЬ НепрочитанныеСообщения
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		ЗаказыСтатус.СтатусЗапроса КАК СтатусЗапроса,
		|		КОЛИЧЕСТВО(ЗаказыСтатус.Ссылка) КАК КоличествоСообщений
		|	ИЗ
		|		ЗаказыСтатус КАК ЗаказыСтатус
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КомментарийПоСтрокам КАК КомментарийПоСтрокам
		|			ПО ЗаказыСтатус.Ссылка = КомментарийПоСтрокам.Документ
		|			И (НЕ КомментарийПоСтрокам.Просмотрен)
		|	СГРУППИРОВАТЬ ПО
		|		ЗаказыСтатус.СтатусЗапроса
		|
		|	ОБЪЕДИНИТЬ
		|
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		ЗаказыСтатус.СтатусЗапроса,
		|		КОЛИЧЕСТВО(ЗаказыСтатус.Ссылка)
		|	ИЗ
		|		ЗаказыСтатус КАК ЗаказыСтатус
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КомментарийПоСтрокам КАК КомментарийПоСтрокам
		|			ПО ЗаказыСтатус.ДокументОснование = КомментарийПоСтрокам.Документ
		|			И (НЕ КомментарийПоСтрокам.Просмотрен)
		|	СГРУППИРОВАТЬ ПО
		|		ЗаказыСтатус.СтатусЗапроса) КАК ВложенныйЗапрос
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.СтатусЗапроса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	КОЛИЧЕСТВО(ЗаказыСтатус.Ссылка) КАК Количество,
		|	ЗаказыСтатус.СтатусЗапроса КАК СтатусЗапроса,
		|	ЕСТЬNULL(НепрочитанныеСообщения.КоличествоСообщений, 0) КАК КоличествоСообщений
		|ИЗ
		|	ЗаказыСтатус КАК ЗаказыСтатус
		|		ЛЕВОЕ СОЕДИНЕНИЕ НепрочитанныеСообщения КАК НепрочитанныеСообщения
		|		ПО (ЗаказыСтатус.СтатусЗапроса = НепрочитанныеСообщения.СтатусЗапроса)
		|СГРУППИРОВАТЬ ПО
		|	ЗаказыСтатус.СтатусЗапроса,
		|	ЕСТЬNULL(НепрочитанныеСообщения.КоличествоСообщений, 0)";
	
	Запрос.УстановитьПараметр("НомерЗаказа", "%" + СокрЛП(НомерЗаказа) + "%");
	Запрос.УстановитьПараметр("ВсеЗапросы", ПустаяСтрока(НомерЗаказа));
	Запрос.УстановитьПараметр("Магазин", ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().Магазин);
	
	ТЗСтатусы = Запрос.Выполнить().Выгрузить();
	
	ДобавитьТЗСтатусовЗапросаДоступности(ТЗСтатусы, Перечисления.СтатусыЗапросовДоступностиТоваровШапка.Новый);
	ДобавитьТЗСтатусовЗапросаДоступности(ТЗСтатусы, Перечисления.СтатусыЗапросовДоступностиТоваровШапка.Изменён);
	ДобавитьТЗСтатусовЗапросаДоступности(ТЗСтатусы, Перечисления.СтатусыЗапросовДоступностиТоваровШапка.ВРаботе);
	//ДобавитьТЗСтатусовЗапросаДоступности(ТЗСтатусы, Перечисления.СтатусыЗапросовДоступностиТоваровШапка.ЧастичноСогласован);
	ДобавитьТЗСтатусовЗапросаДоступности(ТЗСтатусы, Перечисления.СтатусыЗапросовДоступностиТоваровШапка.Согласован);
	ДобавитьТЗСтатусовЗапросаДоступности(ТЗСтатусы, Перечисления.СтатусыЗапросовДоступностиТоваровШапка.Сборка);
	ДобавитьТЗСтатусовЗапросаДоступности(ТЗСтатусы, Перечисления.СтатусыЗапросовДоступностиТоваровШапка.КОтправке);
	ДобавитьТЗСтатусовЗапросаДоступности(ТЗСтатусы, Перечисления.СтатусыЗапросовДоступностиТоваровШапка.Выдан);
	ДобавитьТЗСтатусовЗапросаДоступности(ТЗСтатусы, Перечисления.СтатусыЗапросовДоступностиТоваровШапка.ВыданДоставке);
	ДобавитьТЗСтатусовЗапросаДоступности(ТЗСтатусы, Перечисления.СтатусыЗапросовДоступностиТоваровШапка.Отправлен);
	ДобавитьТЗСтатусовЗапросаДоступности(ТЗСтатусы, Перечисления.СтатусыЗапросовДоступностиТоваровШапка.ТоварВМагазине);
	ДобавитьТЗСтатусовЗапросаДоступности(ТЗСтатусы, Перечисления.СтатусыЗапросовДоступностиТоваровШапка.Получен);
	ДобавитьТЗСтатусовЗапросаДоступности(ТЗСтатусы, Перечисления.СтатусыЗапросовДоступностиТоваровШапка.ПродажаБезнал);
	ДобавитьТЗСтатусовЗапросаДоступности(ТЗСтатусы, Перечисления.СтатусыЗапросовДоступностиТоваровШапка.ПродажаНаКассе);
	ДобавитьТЗСтатусовЗапросаДоступности(ТЗСтатусы, Перечисления.СтатусыЗапросовДоступностиТоваровШапка.ПодтвердитьОтмену);
	ДобавитьТЗСтатусовЗапросаДоступности(ТЗСтатусы, Перечисления.СтатусыЗапросовДоступностиТоваровШапка.Отменён);
	ДобавитьТЗСтатусовЗапросаДоступности(ТЗСтатусы, Перечисления.СтатусыЗапросовДоступностиТоваровШапка.Закрыт);

КонецПроцедуры

&НаСервере
Процедура ДобавитьТЗСтатусовЗапросаДоступности(ТЗСтатусов, Статус)
	
	СтрокаТЗСтатусов = ТЗСтатусов.Найти(Статус,"СтатусЗапроса");
	
	Если Не СтрокаТЗСтатусов = Неопределено Тогда

		НоваяСтрока = СтатусыЗапросовДоступности.Добавить();
		НоваяСтрока.СтатусЗапроса = Строка(Статус);
		НоваяСтрока.СтатусЗапросаПеречисление = Статус;
		НоваяСтрока.Количество = СтрокаТЗСтатусов.Количество;
		НоваяСтрока.Сообщения = СтрокаТЗСтатусов.КоличествоСообщений;
		
	КонецЕсли;

КонецПроцедуры 

&НаКлиенте
Процедура ОбновитьДанные()
	ЗаполнитьТЗСтатусовЗапросаДоступности(); 
	//ПроверитьАктивностьПользовател();
КонецПроцедуры

 // Активность пользователя
&НаКлиенте
Функция РегистрацияАктивностиПользователя(Хеш,Ссылка=Неопределено,Комментарий = "")  
	ТекДата = ТекущаяДата();
	ЗавершитьСеанс = Ложь;

		Простой = 0;
	Если ЗначениеЗаполнено(ВремяАктивностиПользователей) тогда 
		Если НачалоДня(ТекДата)=НачалоДня(ВремяАктивностиПользователей) Тогда
			Простой = ТекДата-ВремяАктивностиПользователей; // в секундах	
		КонецЕсли;
		ВремяЗавершенияРаботыПриБездействии = ПолучитьЗначениеКонстанты("ВремяЗавершенияРаботыПриБездействии");	
		Если ВремяЗавершенияРаботыПриБездействии = 0 тогда 
			ВремяЗавершенияРаботыПриБездействии = 3600;	
		КонецЕсли;
		// Проверяем простой
		Если Простой > ВремяЗавершенияРаботыПриБездействии	Тогда
			ЗавершитьСеанс=Истина;
		КонецЕсли;
		Если Хеш = ХэшАктивностиПользователей Тогда
				// Активности не было...
			Возврат ЗавершитьСеанс;  
		Иначе
			АктивностьПользователейСервер.СделатьЗаписьВРС(Хеш,ТекДата,Ссылка,Комментарий);
		КонецЕсли; 
	Иначе
		АктивностьПользователейСервер.СделатьЗаписьВРС(Хеш,ТекДата,Ссылка,Комментарий);
		ХэшАктивностиПользователей = Хеш;	
	КонецЕсли;
	
	Возврат ЗавершитьСеанс;
КонецФункции	

&НаСервере
Функция ПолучитьЗначениеКонстанты(ИмяКонстанты)
	Возврат ЗначениеНастроекПовтИсп.ПолучитьЗначениеКонстанты(ИмяКонстанты)
КонецФункции


&НаКлиенте
Процедура ПроверитьАктивностьПользовател()  
	Окна = ПолучитьОкна();
	ТекстСообщения = "";
	Ссылка = Неопределено;
	АктивнаяФорма = "";
	Для Каждого ТекОкно Из Окна Цикл
		ТекстСообщения = ТекстСообщения + "["+ТекОкно.Заголовок+"] ";
		Формы = ТекОкно.Содержимое;
		Для Каждого Ф Из Формы Цикл
			Если Ф.ВводДоступен() Тогда
				// Это активная форма
				Ссылка = ПолучитьЗначениеСвойства(ПолучитьЗначениеСвойства(Ф,"Объект"),"Ссылка");//3
				Активность="!";
				АктивнаяФорма = Ф.Заголовок;
			Иначе
				Активность="";
			КонецЕсли;	
			ТекстСообщения = ТекстСообщения 
			+ "("+Ф.Заголовок+": "+ПолучитьЗначениеСвойства(Ф.ТекущийЭлемент,"Имя")+Активность+")";
		КонецЦикла;
	КонецЦикла;
	ЗавершитьСеанс = РегистрацияАктивностиПользователя(ПолучитьХэш(ТекстСообщения),Ссылка,АктивнаяФорма); //4
	Если ЗавершитьСеанс Тогда // 5
		ЗавершитьРаботуСистемы(Истина);
	КонецЕсли;
КонецПроцедуры            

&НаКлиенте
Функция ПолучитьХэш(СтрокаХэш, hash=0, M = 31, TABLE_SIZE = 18446744073709551616)
    //TABLE_SIZE = 18446744073709551615; 64 бита
    //M = 31; Умножитель
    ДлинаСтроки = СтрДлина(СтрокаХэш);
    Для к=1 по ДлинаСтроки цикл
        hash = M * hash + КодСимвола(Сред(СтрокаХэш,к,1));
    конеццикла;
    возврат hash%TABLE_SIZE;
КонецФункции

&НаКлиенте
Процедура ОбновитьЗапросыДоступности()
	ЗаполнитьТЗСтатусовЗапросаДоступности();
	
	СтруктураПоиска = Новый Структура("СтатусЗапросаПеречисление", СтрокаЗапроса);
	
	Строки = СтатусыЗапросовДоступности.НайтиСтроки(СтруктураПоиска);
	Если Строки.Количество() >0 Тогда
		Элементы.СтатусыЗапросовДоступности.ТекущаяСтрока = Строки[0].ПолучитьИдентификатор();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
